{
  "en": {
    "certificationsTitle": "My Certifications",
    "linkAbout": "About Me",
    "linkExperience": "Experience",
    "infrastructure": "Infrastructure",
    "certifications": "Certifications",
    "title": "Welcome to my page!👋",
    "description": "Here you will find information about me, my experience, and skills. 🚀",
    "aboutText": "Experienced DevOps engineer with over 3 years of hands-on experience in automating CI/CD processes, deploying applications, and maintaining production environments. I have a comprehensive understanding of the software development lifecycle (SDLC), gained through work on projects using Agile/Scrum methodologies. I have practical experience with CI/CD tools such as Jenkins, Azure DevOps and cloud environment Azure & Openshift, which allows me to efficiently automate deployment processes, improve development team productivity, and ensure system stability. I quickly learn new technologies and tools, enabling me to adapt effectively to evolving project requirements.",
    "certE12": "E.12. Assembly and operation of personal computers and external devices",
    "certE13": "E.13. Designing of local computer networks and network administration",
    "certE14": "E.14. Creation of web applications and databases and database administration",
    "certIT": "IT Technician",
    "additionalCertsTitle": "Additional Certifications",
    "experienceTitle": "Experience & skills",
    "experienceAndSkills" : "Here's an overview of the technologies and tools I work with",
    "sectionCICD": "CI/CD & Automation",
    "sectionCloud": "Cloud & Containerization",
    "sectionSystems": "Systems & Administration",
    "sectionWeb": "Web/API & Databases",
    "sectionMonitoring": "Monitoring",
    "sectionVC": "Version Control & Collaboration",
    "sectionOther":"Other Tools",
    "infrastructureHeader": "Infrastructure",
    "infrastructureDesc": "Here you will find a detailed overview of the infrastructure used to build this site, including tools and technologies applied during its development.",
    "securityNoticeTitle": "Security Notice:",
    "securityNoticeText": "This repository is public for demonstration and inspiration purposes. It was created as an after-hours side-project to showcase infrastructure, tooling and CI/CD patterns for a personal portfolio. No real credentials, private keys, hostnames, ports or IP addresses are included. All credentials and secrets must be provided via GitHub Actions Secrets or environment variables — without them the resources will not be reachable or operational. DO NOT attempt to connect to any resources using information from this repository - it won't work."

  },
  "pl": {
    "certificationsTitle": "Moje certyfikaty",
    "linkAbout": "O mnie",
    "linkExperience": "Doświadczenie",
    "infrastructure": "Infrastruktura",
    "certifications": "Certyfikaty",
    "title": "Witaj na mojej stronie!👋",
    "description": "Tutaj znajdziesz informacje o mnie, moim doświadczeniu i umiejętnościach. 🚀",
    "aboutText": "Doświadczony inżynier DevOps z ponad 3-letnią praktyką w automatyzacji procesów CI/CD, wdrażaniu aplikacji oraz utrzymaniu środowisk produkcyjnych. Posiadam pełne zrozumienie cyklu życia oprogramowania (SDLC), zdobyte podczas pracy w projektach stosujących metodyki Agile/Scrum. Mam praktyczne doświadczenie w pracy z narzędziami CI/CD, m.in. Jenkins i Ansible oraz środowisku chmurowym Azure i Openshift, co pozwala mi skutecznie automatyzować procesy wdrożeń, zwiększać efektywność zespołów deweloperskich i zapewniać stabilność systemów. Szybko przyswajam nowe technologie i narzędzia, co pozwala mi efektywnie dostosowywać się do zmieniających się wymagań projektów.",
    "certE12": "E.12 Montaż i eksploatacja komputerów osobistych oraz urządzeń peryferyjnych",
    "certE13": "E.13 Projektowanie lokalnych sieci komputerowych i administrowanie sieciami",
    "certE14": "E.14 Tworzenie aplikacji internetowych i baz danych oraz administrowanie bazami",
    "certIT": "Technik Informatyk",
    "additionalCertsTitle": "Dodatkowe certyfikaty",
    "experienceTitle": "Doświadczenie i umiejętności",
    "experienceAndSkills" : "Technologie i narzędzia, z którymi pracuję:",
    "sectionCICD": "CI/CD i automatyzacja procesów",
    "sectionCloud": "Chmura i konteneryzacja",
    "sectionSystems": "Systemy operacyjne i administracja",
    "sectionWeb": "Technologie Web/API i bazy danych",
    "sectionMonitoring": "Monitoring i obserwacja",
    "sectionVC": "Kontrola wersji i współpraca zespołowa",
    "sectionOther": "Pozostałe narzędzia",
    "infrastructureHeader": "Infrastruktura",
    "infrastructureDesc": "W tej sekcji znajdziesz szczegółowy opis infrastruktury użytej do stworzenia tej strony, wraz z narzędziami i technologiami, które zostały zastosowane podczas jej budowy.",
    "securityNoticeTitle": "Uwaga bezpieczeństwa:",
    "securityNoticeText": "To repozytorium jest publiczne i służy celom demonstracyjnym oraz inspiracyjnym. Projekt powstał jako side-project po godzinach, aby zaprezentować infrastrukturę, narzędzia i wzorce CI/CD w ramach portfolio. Nie zawiera prawdziwych danych uwierzytelniających, kluczy prywatnych, nazw hostów, numerów portów ani prawdziwych adresów IP. Wszystkie dane dostępu muszą być dostarczone przez GitHub Actions Secrets lub zmienne środowiskowe — bez nich zasoby nie będą osiągalne ani funkcjonalne. NIE próbuj łączyć się z zasobami używając informacji z tego repozytorium. Rzeczywiste środowisko jest zabezpieczone i bez właściwej konfiguracji środowiskowej połączenia nie zadziałają."
  }
}